; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v5 - type_1 ?v7 - type_2)
 	      (pred_2 ?v4 - object ?v7 - type_2)
	      (pred_4 ?v5 - type_1 ?v3 - type_3)
	      (pred_3 ?v5 - type_1 ?v4 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v5 - type_1 ?v1 ?v8 - type_2)
       :precondition (and  (pred_1 ?v5 ?v1))
       :effect (and  (pred_1 ?v5 ?v8)
		     (not (pred_1 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_1 ?v6 - object ?v2 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v2) (pred_1 ?v5 ?v2) (pred_4 ?v5 ?v3))
       :effect (and (pred_3 ?v5 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v2)) 
		    (not (pred_4 ?v5 ?v3))))

   (:action op_1
       :parameters (?v5 - type_1 ?v6 - object ?v2 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v6 ?v3) (pred_1 ?v5 ?v2))
       :effect (and (pred_2 ?v6 ?v2)
		    (pred_4 ?v5 ?v3)
		    (not (pred_3 ?v5 ?v6 ?v3)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_08 obj_03 - type_1
obj_11 obj_09 obj_12 obj_06 - type_3
obj_10 obj_04 obj_01 - type_2
obj_02 obj_05 obj_07 - object)
(:init
(pred_1 obj_08 obj_10)
(pred_4 obj_08 obj_11)
(pred_4 obj_08 obj_09)
(pred_1 obj_03 obj_01)
(pred_4 obj_03 obj_12)
(pred_4 obj_03 obj_06)
(pred_2 obj_02 obj_01)
(pred_2 obj_05 obj_01)
(pred_2 obj_07 obj_10)
)
(:goal
(and
(pred_2 obj_02 obj_04)
(pred_2 obj_05 obj_10)
(pred_2 obj_07 obj_01)
)
)

(:constraints
  (always (not (pred_1 obj_08 obj_01)))
)
)

; plan
1. (op_3 obj_08 obj_10 obj_04)
   deleted: (pred_1 obj_08 obj_10)
   added: (pred_1 obj_08 obj_04)
   goals met: 0 of 3
2. (op_2 obj_03 obj_05 obj_01 obj_06)
   deleted: (pred_2 obj_05 obj_01) (pred_4 obj_03 obj_06)
   added: (pred_3 obj_03 obj_05 obj_06)
   goals met: 0 of 3
3. (op_3 obj_03 obj_01 obj_10)
   deleted: (pred_1 obj_03 obj_01)
   added: (pred_1 obj_03 obj_10)
   goals met: 0 of 3
4. (op_1 obj_03 obj_05 obj_10 obj_06)
   deleted: (pred_3 obj_03 obj_05 obj_06)
   added: (pred_2 obj_05 obj_10) (pred_4 obj_03 obj_06)
   goals met: 1 of 3
5. (op_2 obj_03 obj_07 obj_10 obj_12)
   deleted: (pred_2 obj_07 obj_10) (pred_4 obj_03 obj_12)
   added: (pred_3 obj_03 obj_07 obj_12)
   goals met: 1 of 3
6. (op_3 obj_03 obj_10 obj_01)
   deleted: (pred_1 obj_03 obj_10)
   added: (pred_1 obj_03 obj_01)
   goals met: 1 of 3
7. (op_1 obj_03 obj_07 obj_01 obj_12)
   deleted: (pred_3 obj_03 obj_07 obj_12)
   added: (pred_2 obj_07 obj_01) (pred_4 obj_03 obj_12)
   goals met: 2 of 3
8. (op_2 obj_03 obj_02 obj_01 obj_06)
   deleted: (pred_2 obj_02 obj_01) (pred_4 obj_03 obj_06)
   added: (pred_3 obj_03 obj_02 obj_06)
   goals met: 2 of 3
9. (op_3 obj_03 obj_01 obj_04)
   deleted: (pred_1 obj_03 obj_01)
   added: (pred_1 obj_03 obj_04)
   goals met: 2 of 3
10. (op_1 obj_03 obj_02 obj_04 obj_06)
   deleted: (pred_3 obj_03 obj_02 obj_06)
   added: (pred_2 obj_02 obj_04) (pred_4 obj_03 obj_06)
   goals met: 3 of 3
